#!/usr/bin/env python3
#அலங்கரிப்பு செயல்பாடுகளுடன் பணியாற்றுவதற்கான எடுத்துக்காட்டு கோப்பு
# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.

def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)


import time as நேரம்

def கழிந்த_நேரம்(வாதம்):
    def மூடுவோன்():
        தொடக்கநேரம் = நேரம்.time()
        வாதம்()
        முடித்தநேரம் = நேரம்.time()
        அச்சிடு(f'கழிந்த நேரம்: {(முடித்தநேரம் - தொடக்கநேரம்) * 1000} ms')
    return மூடுவோன்


@கழிந்த_நேரம் 
def அதிக்கூட்டல்():
    எண்கள் = []
    for எண் in (range(0, 10000)):
        எண்கள்.append(எண்)
    அச்சிடு(f'அதிக்கூட்டல் தொகை: {sum(எண்கள்)}')

def  முதன்மை ():
    அதிக்கூட்டல்()

if __name__ == '__main__' : முதன்மை ()
