# குறைந்தபட்ச மற்றும் அதிகபட்சம் 

#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ

முதல் = 10
இரண்டு = 4
அச்சிடு(min(முதல் , இரண்டு))
அச்சிடு(min(0, 12, -19))

அச்சிடு(min("தமிழ்", "புகழ்"))
அச்சிடு(min("அழகு", "எழில்"))

அச்சிடு(max(இரண்டு, முதல் ))
முன்று = 14
அச்சிடு(max(இரண்டு, முன்று, முதல் ))
அச்சிடு(max("அழகு", "எழில்"))
