#
# செயல்பாடுகளுடன் பணியாற்றுவதற்கான எடுத்துக்காட்டு கோப்பு
#

# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)

# ஒரு அடிப்படை செயல்பாட்டை வரையறுக்கவும்
def செயல்பாடு1():
    அச்சிடு("நான் ஒரு செயல்பாடு")

# வாதங்களை எடுக்கும் செயல்பாடு
def செயல்பாடு2(வாதம்):
    அச்சிடு(வாதம்)
    வாதம்[0]="புதிய"
    அச்சிடு(வாதம்)

# வாதங்களை எடுக்கும் செயல்பாடு
def செயல்பாடு3(வாதம்1,வாதம்2):
    அச்சிடு(வாதம்1," ",வாதம்2)

# ஒரு மதிப்பை வழங்கும் செயல்பாடு
def கனசதுரம்( நீளம் ):
    return  நீளம்*நீளம்*நீளம்

# ஒரு வாதத்திற்கான இயல்புநிலை மதிப்புடன் செயல்பாடு
def சக்தி (எண்,அ=1):
    பலன்=1
    for க in range(அ):பலன்=பலன்*எண் # comprehension
    return பலன்

def முதன்மை ():
    செயல்பாடு1()
    அச்சிடு (செயல்பாடு1())
    அச்சிடு (செயல்பாடு1)
    அ = [1,2,3,4,5]
    அச்சிடு ('அ மாறியின் மதிப்பு',அ)
    செயல்பாடு2(அ)
    அச்சிடு ("அ மாறியின் மதிப்பு",அ)
    அச்சிடு (செயல்பாடு3(30,40))
    அச்சிடு (கனசதுரம்(10))
    ச=சக்தி # () இல்லாமல் செயல்பாடு ஒரு பொருள் 
    அச்சிடு ('சக்தி',ச(2))
    அச்சிடு ('சக்தி',ச(2,3))
    அச்சிடு (சக்தி (எண்=4,அ=3))
    அச்சிடு (பலசேர்(1,2,3,4,5,6,7,8,9))
    அ = (1,2,3,4,5)
    அச்சிடு (பலசேர்(*அ)) # டுப்பிளில் உள்ள உறுப்பினறகளை அனுப்ப *மாறி பயன்படுத்தவும்
    அகராதிபார் (ஐ='தலைவன்', ஆ='பசு',பூ='மலர்')
    அச்சிடு('-----------')
    அகராதிகாண் ({'ஐ':'தலைவன்', 'ஆ':'பசு','பூ':'மலர்'}) # ஒரே வாதம் கொண்ட செயல்பாடு
    அச்சிடு('-----------')
    அகர = dict(ஐ='தலைவன்',ஆ='பசு',மா='மாம்பழம்',பூ='மலர்')
    அச்சிடு ("அகராதி = ",அகர)
    அச்சிடு('-----------')
    அகராதிபார் (**அகர)
    அச்சிடு('-----------')
    அகராதிகாண் (அகர)

#மாறக்கூடிய வாதங்களுடன் செயல்பாடு
#define after main function
def பலசேர் (*வாதங்கள்):
    பலன்=0
    for க in வாதங்கள்:
        பலன் = பலன் + க
    return பலன்

#மாறக்கூடிய பெயரிடப்பட்ட வாதங்கள் கொண்ட செயல்பாடு
def அகராதிபார் (**அகராதி):
    for சொல் in அகராதி:
        அச்சிடு (சொல்,' இதன் பொருள் : ', அகராதி[சொல்])
    
# ஒரே வாதம் கொண்ட செயல்பாடு - அகராதிகாண்
def அகராதிகாண் (அகராதி):
    for சொல் in அகராதி:
        அச்சிடு (சொல்,' இதன் பொருள் : ', அகராதி[சொல்])

if __name__ == '__main__' : முதன்மை ()
#இந்த கோப்பை மற்றொரு கோப்பில் இறக்குமதி செய்து பயன்படுத்தும்பொது முதன்மை() இயங்கும். 
