#!/usr/bin/env python3
# தோற்றிகள்

# உள்ளீடு, அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
 
def முதன்மை ():
    for ஐ in தொடர்(25):
        அச்சிடு(ஐ, முடி = ' ')
    அச்சிடு()

def தொடர்(*வாதங்கள்):
    எண்ணிக்கை = len(வாதங்கள்)
    தொடக்கம் = 1
    படி = 1
    
    # வாதங்களின் துவக்க மதிப்புகளை அமை
    if எண்ணிக்கை  < 1:
        raise TypeError(f'எதிர்பார்த்தது குறைந்தபட்சம் 1 வாதம், கிடைத்தது {எண்ணிக்கை}')
    elif எண்ணிக்கை  == 1:
        முடிவு = வாதங்கள்[0]
    elif எண்ணிக்கை  == 2:
        (தொடக்கம், முடிவு) = வாதங்கள்
    elif எண்ணிக்கை == 3:
        (தொடக்கம், முடிவு, படி) = வாதங்கள்
    else: raise TypeError(f'எதிர்பார்த்தது அதிக பட்சம் 3 வாதங்கள், கிடைத்தது  {எண்ணிக்கை}')

    # எண்தோற்றி தோற்றி
    ஐ = தொடக்கம்
    while ஐ <= முடிவு:
        yield ஐ
        ஐ += படி

if __name__ == '__main__': முதன்மை ()
