# நீளம் கணக்கிடுகிறது 

#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ
# len() -->  நீளம் தரும்
def நீளம்(*arg):
    return len(*arg)

முதல்பெயர் = "புகழேந்தி"
அச்சிடு(நீளம்(முதல்பெயர்))
பின்பெயர் = "அனிஷ்பிரபு"
அச்சிடு(நீளம்(பின்பெயர்))
முதல்பெயர்.__len__()

தரவு = [0, 11, 43, 12, 10]
அச்சிடு(நீளம்(தரவு))
அச்சிடு(தரவு)

ஐ = 0
for ஐ in range(0, len(தரவு)):
    அச்சிடு(தரவு[ஐ])

அச்சிடு(நீளம்(["கந்தசாமி", "ராமசாமி", "திருப்பதி"]))

சேகரிப்பு = {"கந்தசாமி" : 10, "ராமசாமி" : 7, "திருப்பதி" : 18}
அச்சிடு(நீளம்(சேகரிப்பு ))

அச்சிடு(சேகரிப்பு )
