#!/usr/bin/env python3
# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)


from random import shuffle

அ = ['ஊ', 'a', 'A', 'b', 'B','ஆ', 'அ']

அ.reverse()
அச்சிடு(அ)
அ = அ[::-1]
அச்சிடு(அ)
அ = list(reversed(அ))
அச்சிடு(அ)
அச்சிடு(len(அ))
shuffle(அ)
அச்சிடு(அ)
அ.sort()
அச்சிடு(அ)

#அச்சிடு(len(filter(அ,lambda x:x == 'a')))

அச்சிடு(அ.count('a'))
if 'a' in அ:
    அ.remove('a')
அச்சிடு(அ)
l=அ.pop()
அச்சிடு(l)
அச்சிடு(அ)
