#வரிசைப்படுத்தப்பட்டது

#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ

# சிறியது முதல் பெரியது 
புள்ளிகள் = [0, -10, 15, -2, 1, 12]
வரிசைப்புள்ளிகள் = sorted(புள்ளிகள்)
அச்சிடு(வரிசைப்புள்ளிகள்)

# அகர வரிசைப்படி 
குழந்தைகள் = ["தேன்", "புகழ்","அருள்"]
அச்சிடு(sorted(குழந்தைகள்))
அச்சிடு(sorted(["அருள்", "புகழ்","தேன்"]))

# முக்கிய வாதங்கள்
அச்சிடு(sorted("எனக்கு பிடித்த குழந்தை புகழ்".split(), key=str.upper))
அச்சிடு(sorted(புள்ளிகள், reverse=True))

முன்னிலை = {231: "வர்மன்", 123:"அருள்", 432:"மொழி"}
அச்சிடு(sorted(முன்னிலை, reverse=True))
அச்சிடு(முன்னிலை.get(432))

மாணவர்கள் = [ ('தேன்', 'ஆ', 12), ('புகழ்', 'அ', 16), ('அருள்', 'இ', 15)]
அச்சிடு(sorted(மாணவர்கள், key=lambda மாணவர்:மாணவர்[0]))
அச்சிடு(sorted(மாணவர்கள், key=lambda மாணவர்:மாணவர்[1]))
அச்சிடு(sorted(மாணவர்கள், key=lambda மாணவர்:மாணவர்[2]))

