#
# நிபந்தனை அறிக்கைகளுடன் பணியாற்றுவதற்கான எடுத்துக்காட்டு கோப்பு 
#

# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்):
    print(*வாதங்கள்)


def முதன்மை():
    அ,ஆ  = 100, 10

    #நிபந்தனை ஓட்டம் if, elif, else பயன்படுத்துகிறது
    if (அ<ஆ):
        அறிக்கை= " ஆ விட குறைவாக உள்ளது அ"
    elif (அ==ஆ):
        அறிக்கை= "அ என்பது ஆ க்கு சமம்"
    else:
        அறிக்கை= "அ விட  குறைவாக உள்ளது ஆ"
        அச்சிடு('அ>ஆ; அ ={} மற்றும் ஆ={}'.format(அ,ஆ))
    அச்சிடு (அறிக்கை)
    # நிபந்தனை அறிக்கைகள் "அ if ஐ else ஆ" ஐப் பயன்படுத்த அனுமதிக்கின்றன 

    அறிக்கை =" ஆ விட குறைவாக உள்ளது அ" if (அ<ஆ) else "அ விட  குறைவாக அல்லது சம்மாக உள்ளது ஆ" 
    அச்சிடு (அறிக்கை)
    #பைத்தானுக்கு உயர்-வரிசை நிபந்தனைகளுக்கு ஆதரவு இல்லை
    #பிற மொழிகளில் "சுவிட்ச்-கேஸ்" போன்றது
    
if __name__ == "__main__":
    முதன்மை()
