# Command Line Arguments

#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ

import sys as முறைமை

# அச்சிடு வாதங்கள்
அச்சிடு("வாதஎண்ணிக்கை: ", len(முறைமை.argv), ' வாதங்கள்.')
அச்சிடு("வாதங்கள் ", முறைமை.argv)

# நீக்கு வாதங்கள்
முறைமை.argv.remove(முறைமை.argv[0])

அச்சிடு("வாதங்கள்", முறைமை.argv)

# வாதங்களை கூட்டு
வாதங்கள் = முறைமை.argv
கூட்டு = 0
for வாதம் in வாதங்கள்:
    try:
        எண் = int(வாதம்)
        கூட்டு = கூட்டு + எண்
    except Exception:
        அச்சிடு("தவறான உள்ளீடு ")

அச்சிடு(கூட்டு)
