# கணித தொகுதி பகுதி 2
# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)

import math as கணிதம்

# காரணி & சதுர வேர்
அச்சிடு('5! யின் மதிப்பு : ',கணிதம்.factorial(5))
அச்சிடு(கணிதம்.sqrt(64))

# மிகப்பெரிய பொதுவான வகுத்தல் மி.பொ.வ.
அச்சிடு(கணிதம்.gcd(52, 8))

அச்சிடு(8/52)
அச்சிடு(2/13)
# மிகப்பெரிய பொதுவான வகுத்தல் மி.பொ.வ.
அச்சிடு(கணிதம்.lcm(45,110))
# டிகிரி மற்றும் ரேடியன்சு
அச்சிடு(கணிதம்.radians(360))
அச்சிடு(கணிதம்.pi * 2)
அச்சிடு(கணிதம்.degrees(கணிதம்.pi * 2))
