# சீரற்ற தொகுதி
# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)

import random as சீரற்ற

# சீரற்ற எண்கள்
சீரற்றஎண் = சீரற்ற.randint(1,52)
அச்சிடு ('சீரற்றஎண் : ',(சீரற்றஎண்))

அச்சிடு(சீரற்ற.random())
தீர்மானிப்பவர் = சீரற்ற.randrange(2)
if தீர்மானிப்பவர் == 0:
    அச்சிடு("தலை")
else:
    அச்சிடு("பூ")
அச்சிடு(தீர்மானிப்பவர்)

அச்சிடு("நீங்கள் உருட்டியது " + str(சீரற்ற.randrange(1, 7)))

# சீரற்ற தேர்வுகள்
வெற்றியாளர்கள் = சீரற்ற.sample(range(100), 5)
அச்சிடு(வெற்றியாளர்கள்)

செல்லப்பிராணிகள் = ["பூனை", "நாய்", "மீன்"]
அச்சிடு(சீரற்ற.choice(செல்லப்பிராணிகள்))

அட்டைகள் = [ "சாக்", "ராணி", "அரசர்", "ஏசு"]
சீரற்ற.shuffle(அட்டைகள் )
அச்சிடு(அட்டைகள் )


அச்சிடு (சீரற்ற.choice ([71,12,31,54,15,62]))
அச்சிடு (சீரற்ற.randrange (7,22,3))
அச்சிடு (சீரற்ற.random())
அ = [71,12,31,54,15,62]
அச்சிடு (அ)
சீரற்ற.shuffle (அ)
அச்சிடு (அ)
அச்சிடு (சீரற்ற.uniform (3,4))
