#புள்ளிவிவரங்கள் தொகுப்பு

#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ


import statistics as புள்ளிவிவரங்கள்
import math as கணக்கு

தரவு = [10, 13, 14, 12, 11, 10, 11, 10, 15]

அச்சிடு(புள்ளிவிவரங்கள்.mean(தரவு))
அச்சிடு(புள்ளிவிவரங்கள்.mode(தரவு))
அச்சிடு(புள்ளிவிவரங்கள்.median(தரவு))
அச்சிடு(sorted(தரவு))

அச்சிடு(புள்ளிவிவரங்கள்.variance(தரவு))
அச்சிடு(புள்ளிவிவரங்கள்.stdev(தரவு))
அச்சிடு(கணக்கு.sqrt(புள்ளிவிவரங்கள்.variance(தரவு)))
