# மறு செய்கை கருவிகள் 

#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ

import itertools as மறுசெய்கருவிகள் 

#எல்லையற்ற எண்ணுதல்
for ஔ in மறுசெய்கருவிகள்.count(50, 5):
    அச்சிடு(ஔ)
    if ஔ == 80:
        break;

ஔ = 0;
# எல்லையற்ற பட்டியல் மறுபடி செய்கைகள் 
for அ in மறுசெய்கருவிகள்.cycle([1, 2, 3, 4]):
    அச்சிடு(அ)
    ஔ = ஔ + 1
    if ஔ > 50:
        break;

# எல்லையற்ற மறுபடி செய்கைகள் 
for ஆ in மறுசெய்கருவிகள்.repeat(True):
    அச்சிடு(ஆ)
    ஔ = ஔ + 1
    if ஔ > 100:
        break;

