#!/usr/bin/env python3

# எண்கள்
# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)

#முழு எண்கள்
அ = 15
அச்சிடு('அ மாறியின் மதிப்பு {}'.format(அ))
அச்சிடு('அ மாறியின் மதிப்பு ', oct(அ))
அச்சிடு('அ மாறியின் வகை ', type(அ), ' அடையாள எண்', id(அ))

ஆ =0o12
அச்சிடு('ஆ மாறியின் மதிப்பு ',ஆ)
அச்சிடு('ஆ மாறியின் மதிப்பு ', bin(ஆ))

இ=0x9A
அச்சிடு('இ மாறியின் மதிப்பு ',இ )
அச்சிடு('இ மாறியின் மதிப்பு ', hex(இ))

ஈ =0b1110
அச்சிடு('ஈ மாறியின் மதிப்பு ', bin(ஈ))
அச்சிடு('ஈ மாறியின் மதிப்பு ', oct(ஈ))
அச்சிடு('ஈ மாறியின் மதிப்பு ',ஈ)

#மிதக்கும் புள்ளி எண்
அ = 7*3.14159
அச்சிடு('அ வின் மதிப்பு {}'.format(அ))
அச்சிடு('அ மாறியின் வகை ', type(அ), ' அடையாள எண்', id(அ))

# மதிப்பு 0 அல்ல. 0க்கு அருகில்.
ஆ = 0.1+0.1+0.1-0.3
அச்சிடு ('0.1+0.1+0.1-0.3 = ', ஆ)


#சிக்கலான எண்கள் 
அ= 4+2j
ஆ =5+3j
இ = அ+ஆ
அச்சிடு('இ மாறியின் வகை ', type(இ), ' அடையாள எண்', id(அ))

#தரவு வகையை மாற்ற
ஈ =float(44)
உ= int(13.24)
ஊ = complex(10)

அச்சிடு (ஈ,உ,ஊ)

#சிறப்பு வகுப்பு 
import decimal as தசம

அ = தசம.Decimal('.10')
ஆ = தசம.Decimal ('.30')
இ = அ+அ+அ - ஆ

அச்சிடு ('இ மாறியின் மதிப்பு ', இ)
அச்சிடு('இ மாறியின் வகை ', type(இ))

ஐ = 7>5
அச்சிடு ('ஐ மாறியின் மதிப்பு ', ஐ)
அச்சிடு('ஐ மாறியின் வகை ', type(ஐ))


