#!/usr/bin/env python3

# எண் இயக்கிகள் +,-,*,/,//,%,**
# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)

#முழு எண்கள்
அ = 5
ஆ =0o12
இ=0x9A
ஈ =0b1110
உ=(அ&ஈ)|10
#ஒருமை இயக்கிகள்
ஊ = -அ
ஒ = ~அ
அச்சிடு(ஊ)
அச்சிடு(ஒ)
# இருமம் வாரியாக  இயக்கிகள் & ,|,^,<<,>> - and or xor shiftleft shiftright  
எ=அ^ஆ
ஏ=அ<<2
ஐ=அ>>2
ஐ**=2
ஊ = (அ and ஈ ) or 10

#எண்களில் உள்ள தருக்க இயக்கிகள் அதே மதிப்பு விளைவாகும்
அச்சிடு(f'(hex)அ is {அ:02x}, ஈ is {உ:02x}, உ is {உ:02x}')
அச்சிடு(f'(bin) அ is {அ:08b}, ஈ is {உ:08b}, ஊ is {ஊ:08b}')
எ=ஆ//அ
ஏ=ஆ%அ
அச்சிடு(உ)
அச்சிடு(ஊ)

#சிக்கலான எண்கள்
அ= 4+2j
ஆ =5+3j
இ = அ+ஆ
ஈ =அ-ஆ
உ=அ*ஆ
ஊ=அ/ஆ
எ =அ**2
ஏ =அ**ஆ
அச்சிடு (இ,ஈ,உ,ஊ,எ,ஏ)
