#!/usr/bin/env python3

# எண் இயக்கிகள் +,-,*,/,//,%,**
# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்):
    print(*வாதங்கள்)

#முழு எண்கள்
அ = 7
ஆ =0o12
இ=0x9A
ஈ =0b1110
உ=(அ&ஈ)|10
# bitwise operators & ,|,^,<<,>> - and or xor shiftleft shiftright  
எ=அ^ஆ
ஏ=அ<<2
ஐ=அ>>2
ஐ**=2
ஊ = (அ and ஈ ) or 10
# logical operator on numbers results in same.
அச்சிடு(f'(hex)அ is {அ:02x}, ஈ is {உ:02x}, உ is {உ:02x}')
அச்சிடு(f'(bin) அ is {அ:08b}, ஈ is {உ:08b}, ஊ is {ஊ:08b}')
எ=ஆ//அ
ஏ=ஆ%அ
அச்சிடு(உ)
அச்சிடு(ஊ)


#complex numbers
அ= 4+2j
ஆ =5+3j
இ = அ+ஆ
ஈ =அ-ஆ
உ=அ*ஆ
ஊ=அ/ஆ
எ =அ**2
ஏ =அ**ஆ
அச்சிடு (இ,ஈ,உ,ஊ,எ,ஏ)
