# ஒன்றுமில்லை வகை
# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்):
    print(*வாதங்கள்)


   
அச்சிடு('type (None) இன் மதிப்பு : ', type (None))
அச்சிடு('None == 0 இன் மதிப்பு : ', None == 0)
அச்சிடு('None == "" இன் மதிப்பு : ', None == "")
அச்சிடு('None ==  None இன் மதிப்பு : ', None ==  None)

அ =  None
ஆ =  None
மதிப்பு = அச்சிடு('அ,ஆ மாறியின் மதிப்பு : ', அ, ஆ)
அச்சிடு(f'அனைத்து செயல்பாடுகளும் இயல்பாக {மதிப்பு} தரும்.')
அச்சிடு('அ ==  None இன் மதிப்பு : ', அ ==  None)
அச்சிடு('அ == ஆ இன் மதிப்பு : ', அ == ஆ)





