#தமிழ் நாள் நேரம் கணக்கிடுதல்
from datetime import datetime

def முதன்மை():
    இப்போது = datetime.now () # தற்போதைய தேதி மற்றும் நேரத்தைப் பெறுங்கள்
    
    #தமிழ் வாரநாள் - கிழமை
    வாரநாள்= int(இப்போது.strftime("%w"))
    கிழமைகள்= ["ஞாயிறு","திங்கள்","செவ்வாய்","அறிவன்","வியாழன்","வெள்ளி","காரி"]
    கிழமை=கிழமைகள்[வாரநாள்]

    #தற்போதைய மணி, நிமையம் மற்றும் நொடி பெறுங்கள்
    மணி=int(இப்போது.strftime("%H"))
    நிமையம்=int(இப்போது.strftime("%M"))
    நொடி=int(இப்போது.strftime("%S"))
    #print( மணி, நிமையம், நொடி )

    #தமிழ்நேர மாற்றம்
    if (மணி<2):
        மணி=மணி+24
    மணி=மணி-2
    நிமையம்=மணி*60+நிமையம்
    #print( மணி, நிமையம் )

    #1கணம் = 4 நிமையம்
    கணம்=நிமையம்//4
    நிமையம்=நிமையம்%4
    #print( கணம், நிமையம் )

    # 1நாழிகை = 6 கணம்
    நாழிகை=கணம்//6
    கணம்=கணம்%6
    #print( கணம், நிமையம் )

    #1பொழுது= 10 நாழிகை
    சிறுபொழுது=நாழிகை//10
    நாழிகை=நாழிகை%10
    #print(  சிறுபொழுது,கணம்)
    
    பொழுதுகள்=['வைகறை', 'காலை', 'நண்பகல்', 'எற்பாடு', 'மாலை', 'யாமம்']
    பொழுது=பொழுதுகள்[சிறுபொழுது]
   
    #print("கிழமை "+கிழமை,"பொழுது "+பொழுது, "நாழிகை "+str(நாழிகை), "கணம் "+str(கணம்), "நிமையம் "+str(நிமையம்), "நொடி "+str(நொடி), sep=":")
    print("கிழமை",கிழமை,": பொழுது", பொழுது, ": நாழிகை", நாழிகை, ": கணம்",கணம், ": நிமையம்",நிமையம், ": நொடி",நொடி )
    

if __name__ == "__main__":
  முதன்மை();
