#
# சுழல்களுடன் வேலை செய்வதற்கான எடுத்துக்காட்டு கோப்பு
#
#need to add else to for & while loop example

# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்):
    print(*வாதங்கள்)

def முதன்மை():
  அ = 0

  # while (தவறில்லாதபோது()) சுழற்சியை வரையறுக்கவும் 
  while (அ<5):
    அச்சிடு (அ)
    அ=அ+1

  அ = 0
  நாட்கள்= ["ஞாயிறு","திங்கள்","செவ்வாய்","புதன்","வியாழன்","வெள்ளி","காரி"]
  while (அ<7):
    அச்சிடு(நாட்கள்[அ])
    அ +=1
  
  # for (பட்டியல்(+இல்))சுழற்சியை வரையறுக்கவும் 
  for அ in range (5,10):
    அச்சிடு (அ)

  else:
    அச்சிடு ('அ பட்டியல் முடிந்தது. கடை எண்',அ)

  # சேகரிப்பில் for சுழற்சியைப் பயன்படுத்தவும்
  நாட்கள்= ["ஞாயிறு","திங்கள்","செவ்வாய்","புதன்","வியாழன்","வெள்ளி","காரி"]
  for நாள் in நாட்கள்:
    அச்சிடு(நாள்)
  
  # break(முறிவு) மற்றும் continue(தொடர்) அறிக்கைகளைப் பயன்படுத்தவும்
  for அ in range(5,50):
    if (அ==35): break
    if (அ%2==0): continue
    அச்சிடு (அ)
  else:
    அச்சிடு ('அ பட்டியல் முடிந்தது. கடை எண்',அ) #இது அச்சிடபடாது (break is exiting loop)

  #குறியீட்டைப் பெற enumerate(கணக்கீடு()) செயல்பாட்டைப் பயன்படுத்துதல்
  நாட்கள்= ["ஞாயிறு","திங்கள்","செவ்வாய்","புதன்","வியாழன்","வெள்ளி","காரி"]
  for ஐ,நாள் in enumerate(நாட்கள்):
    அச்சிடு (ஐ,நாள்)
    
if __name__ == "__main__":
  முதன்மை()
