#!/usr/bin/env python3
#முதன்மை_எண்கள்

#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ

def முதன்மை_எண்(எ):
    if எ <= 1:
        return False
    for ஐ in range(2, எ):
        if எ % ஐ == 0:
            return False
    else:
        return True

எ = 5
if முதன்மை_எண்(எ):
    print(f'{எ} முதன்மை எண்')
else:
    print(f'{எ} முதன்மை எண் அல்ல')

