# Files and File Writing
# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள், பிரி=" ", முடி='\n', கோப்பு=None, பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி, end=முடி, file=கோப்பு, flush=பறிப்பு)

# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.


def உள்ளீடு(*வாதங்கள்):
    அ = input(*வாதங்கள்)
    return அ


# ஒரு கோப்பைத் திறக்கவும்
எனதுகோப்பு = open("மதிப்பெண்கள்.உரை", "w")

# Show attributes and properties of that file
print("பெயர் " + எனதுகோப்பு.name)
print("பயன்முறை " + எனதுகோப்பு.mode)

# Write to a file
எனதுகோப்பு.write("கோபு : 100\nராணி : 99\nஅழகன் : 89")
எனதுகோப்பு.close()

# கோப்பைப் படியுங்கள்
எனதுகோப்பு = open("மதிப்பெண்கள்.உரை", "r")
print("படித்தல்... : " + எனதுகோப்பு.read(10))
print("மீண்டும் படித்தல் : " + எனதுகோப்பு.read(10))
எனதுகோப்பு.close()
எனதுகோப்பு = open("மதிப்பெண்கள்.உரை", "r")
print("படித்தல்... : " + எனதுகோப்பு.read(10))
எனதுகோப்பு.seek(0)
print("மீண்டும் படித்தல் : " + எனதுகோப்பு.read(10))
எனதுகோப்பு.close()

# மறுபயன்பாட்டு கோப்புகள்
எனதுகோப்பு = open("மதிப்பெண்கள்.உரை", "r")

# ஒரு நேரத்தில் ஒரு வரியைப் படியுங்கள்
print("எனது ஒரு வரி: " + எனதுகோப்பு.readline())
எனதுகோப்பு.seek(0)

# ஒரு கோப்பின் ஒவ்வொரு வரியிலும் சொல்லுங்கள்
for வரி in எனதுகோப்பு:
    புதியஉயர்மதிப்பெண் = வரி.replace("கோபு", "கோபிநாதன்")
    print(புதியஉயர்மதிப்பெண்)

எனதுகோப்பு.close()
