#
# நாள்காட்டிகளுடன் பணியாற்றுவதற்கான எடுத்துக்காட்டு கோப்பு
#

# நாள்காட்டி தொகுதியை இறக்குமதி செய்க
import calendar

# எளிய உரை நாள்காட்டியை உருவாக்கவும்
நாள் = calendar.TextCalendar(calendar.MONDAY)
சரம்=நாள்.formatmonth(2017,1,0,0)
print(சரம்)

# ஒரு HTML வடிவமைக்கப்பட்ட நாள்காட்டியை உருவாக்கவும்
வடிவுநாள் = calendar.HTMLCalendar(calendar.SUNDAY)
வடிவுசரம்=வடிவுநாள்.formatmonth(2017,1)
print(வடிவுசரம்)

# வளையம் ஒரு மாத நாட்களில்
# பூஜ்ஜியங்கள் என்பது வாரத்தின் நாள் ஒன்றுடன் ஒன்று என்று பொருள்
# loop over the days of a month
# zeroes mean that the day of the week is in an overlapping month

for ஐ in நாள்.itermonthdays(2017,8):
    print (ஐ)
  
# நாள்காட்டி தொகுதி கொடுக்கப்பட்ட இடத்திற்கு பயனுள்ள பயன்பாடுகளை வழங்குகிறது,
# முழு மற்றும் சுருக்கமான வடிவங்களில் நாட்கள் மற்றும் மாதங்களின் பெயர்கள் போன்றவை
for மாதம் in calendar.month_name:
    print (மாதம்)

for கிழமை in calendar.day_name:
    print (கிழமை)


# ஒரு விதியின் அடிப்படையில் நாட்களைக் கணக்கிடுங்கள்: எடுத்துக்காட்டாக, கவனியுங்கள்
# ஒவ்வொரு மாதமும் முதல் வெள்ளிக்கிழமை ஒரு குழு கூட்டம்.
# ஒவ்வொரு மாதத்திற்கும் என்ன நாட்கள் இருக்கும் என்பதைக் கண்டுபிடிக்க,
# இந்த கட்டளைஉரையை நாம் பயன்படுத்தலாம்:

print("குழு கூட்டங்கள் இருக்கும்:")
for ம in range(1,13):
   # மாதத்தைக் குறிக்கும் வாரங்களின் வரிசையை வழங்குகிறது
   நாட்காட்டி= (2017, ம)
   # முதல் வெள்ளிக்கிழமை முதல் இரண்டு வாரங்களுக்குள் இருக்க வேண்டும்
   முதல்வாரம் = நாட்காட்டி[0]
   இரண்டாம்வாரம் = நாட்காட்டி[1]
   
   if வாரந்தோறும் [நாட்காட்டி. FRIDAY]! = 0:
     சந்திப்பு நாள் = வாராந்திர [காலண்டர். FRIDAY]
   வேறு:
     # முதல் வெள்ளிக்கிழமை முதல் வாரத்தில் இல்லை என்றால், அது இரண்டாவது வாரத்தில் இருக்க வேண்டும்
     meetday = weektwo [நாட்காட்டி. FRIDAY]
      
   அச்சு ("% 10s% 2d"% (நாட்காட்டி. மாத_பெயர் [மீ], சந்திப்பு நாள்))
