# பைதான் ஒப்பீட்டு இயக்கிகள்

#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ

# உதவிக்குறிப்புகள்:
# ==    -->  சமம்மா?
# !=     -->  சமம்மில்லையா?
# <=    --> குறைவாகவோ அல்லது சமமாகவோ உள்ளதா?
# > =   --> அதிகமாகவோ அல்லது சமமாகவோ உள்ளதா?
# <      --> ஐ விட குறைவா?
# >      --> ஐ விட பெரியதா?
# <      --> ஐ விட குறைவா?
print(10 != 75)
print(75 < 10)

if 10 < 75:
    print("The bigger number is bigger")
else:
    print('comparison is false')

# ==    --> சமம்மா?
kitten = 10
tiger = 75

if kitten < tiger:
    print("The kitten weighs less than the tiger")

# <     --> ஐ விட குறைவாக உள்ளதா?
mouse = 1
if mouse < kitten and mouse < tiger:
    print("The mouse weighs the least")


#False --> 0
#True --> 1
# >     --> விட பெரியதா?
print(False > True)

# பொருந்தாத முதல் எழுத்தைத் தேடுகிறது
# A - Z -> 65 - 90
# >     --> விட பெரியது
print("Jennifer" > "Jenny")

# a - z -> 97 - 122
# <=    --> குறைவாகவோ அல்லது சமமாகவோ உள்ளது 
print('a' <= 'b')
