# பைதான் ஒப்பீட்டு இயக்கிகள்

#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ

# உதவிக்குறிப்புகள்:
# ==    -->  சமம்மா?
# !=     -->  சமம்மில்லையா?
# <=    --> குறைவாகவோ அல்லது சமமாகவோ உள்ளதா?
# > =   --> அதிகமாகவோ அல்லது சமமாகவோ உள்ளதா?
# <      --> ஐ விட குறைவா?
# >      --> ஐ விட பெரியதா?
# <      --> ஐ விட குறைவா?
அச்சிடு(10 != 75)
அச்சிடு(75 < 10)

if 10 < 75:
    அச்சிடு("எண் 75 10 ஐ விட பெரியது")
else:
    அச்சிடு('ஒப்பீடு தவறானது')

# ==    --> சமம்மா?
பூனைக்குட்டி = 10
புலி = 75

if பூனைக்குட்டி  < புலி:
    அச்சிடு("பூனைக்குட்டியை புலியை விட குறைவான எடை")

# <     --> ஐ விட குறைவாக உள்ளதா?
எலி = 1
if எலி < பூனைக்குட்டி  and எலி  < புலி:
    அச்சிடு("எலி மிகக் குறைந்த எடையைக் கொண்டுள்ளது")

#False --> 0
#True --> 1
# >     --> விட பெரியதா?
அச்சிடு(False > True)

# பொருந்தாத முதல் எழுத்தைத் தேடுகிறது
# A - Z -> 65 - 90
# >     --> விட பெரியது
அச்சிடு("அண்ணா" > "அருண்")


# <=    --> குறைவாகவோ அல்லது சமமாகவோ உள்ளது 
அச்சிடு('அ' <= 'ஆ')
