
# பைதான் தருக்க இயக்கிகள்: மற்றும், அல்லது, இல்லை:

# பூலியன் என்றால் என்ன?
மழைபொழிகிறதா = False
வெயிலாகஇருக்கிறதா = True

# Logical Operators -> Special Operators for Booleans
# and, or, not, in {}, not in {},is <object>, is not <> 

# மற்றும்
# உண்மை மற்றும் உண்மை -> உண்மை
# பொய் மற்றும் உண்மை -> பொய்
# உண்மை மற்றும் பொய் -> பொய்
# பொய் மற்றும் பொய் -> பொய்

if மழைபொழிகிறதா and வெயிலாகஇருக்கிறதா:
    print("நாம் ஒரு வானவில் காணலாம்")

# அல்லது
# உண்மை அல்லது உண்மை -> உண்மை
# பொய் அல்லது உண்மை -> உண்மை
# உண்மை அல்லது பொய் -> உண்மை
# பொய் அல்லது பொய் -> பொய்

if மழைபொழிகிறதா or வெயிலாகஇருக்கிறதா:
    print("வெளியே செல்லும் போது பாதுகாக்க ஒரு குடையை எடுத்துக் கொள்ளுங்கள்")

# இல்லை
# உண்மை -> பொய்
# பொய் -> உண்மை

if not மழைபொழிகிறதா:
    print("அது உலர்ந்ததாக இருக்க வேண்டும் ")

வயதுகள் = [12, 18, 39, 87, 7, 2]
for வயது in வயதுகள்:
    வயதுவந்தவர் = வயது > 17;
    if not வயதுவந்தவர்:
        print( "வயது " + str (வயது) + "ஆக இருப்பது, உங்களை வயது வந்தவராக்காது.")


விலங்குகள் = ( 'bear', 'bunny', 'tree', 'sky', 'rain' )
விலங்கு = 'bear'

if விலங்கு in விலங்குகள் :
    print('expression is true')
else:
    print('expression is false')
