#
# நாள்காட்டிகளுடன் பணியாற்றுவதற்கான எடுத்துக்காட்டு கோப்பு
#

#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)

#அச்சிடு = print
#உள்ளீடு = input 
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ

# நாள்காட்டி தொகுதியை இறக்குமதி செய்க
import calendar as நாட்காட்டி

# எளிய உரை நாள்காட்டியை உருவாக்கவும்
நாள்காட்டு = நாட்காட்டி.TextCalendar(நாட்காட்டி.MONDAY)
சரம்=நாள்காட்டு.formatmonth(2017,1,0,0)
அச்சிடு(சரம்)

# ஒரு HTML வடிவமைக்கப்பட்ட நாள்காட்டியை உருவாக்கவும்
வடிவுநாள் = நாட்காட்டி.HTMLCalendar(நாட்காட்டி.SUNDAY)
சரம்=வடிவுநாள்.formatmonth(2017,1)
அச்சிடு(சரம்)

# ஒரு மாத நாட்களில் சுழற்ச்சி
# சுழியங்கள் என்பது வாரத்தின் நாள் பிற மாத நாள் என்று பொருள்
# 

for ஐ in நாள்காட்டு.itermonthdays(2017,8):
    அச்சிடு (ஐ)
  
# நாள்காட்டி தொகுதி கொடுக்கப்பட்ட இடத்திற்கு பயனுள்ள பயன்பாடுகளை வழங்குகிறது,
# முழு மற்றும் சுருக்கமான வடிவங்களில் நாட்கள் மற்றும் மாதங்களின் பெயர்கள் போன்றவை
for மாதம் in நாட்காட்டி.month_name:
    அச்சிடு (மாதம்)

for கிழமை in நாட்காட்டி.day_name:
    அச்சிடு (கிழமை)


# ஒரு விதியின் அடிப்படையில் நாட்களைக் கணக்கிடுங்கள்: எடுத்துக்காட்டாக, கவனியுங்கள்
# ஒவ்வொரு மாதமும் முதல் வெள்ளிக்கிழமை ஒரு குழு கூட்டம்.
# ஒவ்வொரு மாதத்திற்கும் என்ன நாட்கள் இருக்கும் என்பதைக் கண்டுபிடிக்க,
# இந்த கட்டளைஉரையை நாம் பயன்படுத்தலாம்:

அச்சிடு("குழு கூட்டங்கள் இருக்கும் நாட்கள்:")
for ம in range(1,13):
    # மாதத்தைக் குறிக்கும் வாரங்களின் வரிசையை வழங்குகிறது
    நாள்காட்டு= நாட்காட்டி.monthcalendar(2017, ம)
    # முதல் வெள்ளிக்கிழமை முதல் இரண்டு வாரங்களுக்குள் இருக்க வேண்டும்
    முதல்வாரம் = நாள்காட்டு[0]
    இரண்டாம்வாரம் = நாள்காட்டு[1]
    if முதல்வாரம்[நாட்காட்டி.FRIDAY] != 0:
        சந்திப்புநாள் = முதல்வாரம்[நாட்காட்டி.FRIDAY]
    
    else:
        # முதல் வெள்ளிக்கிழமை முதல் வாரத்தில் இல்லை என்றால், அது இரண்டாவது வாரத்தில் இருக்க வேண்டும்
        சந்திப்புநாள் = இரண்டாம்வாரம் [நாட்காட்டி.FRIDAY]
    அச்சிடு ("%10s %2d"% (நாட்காட்டி. month_name[ம], சந்திப்புநாள்))


கால் = நாட்காட்டி.month(2001, 10)
அச்சிடு(கால்)

கால்2 = நாட்காட்டி.weekday(2001, 10, 11)
அச்சிடு(கால்2)

அச்சிடு(நாட்காட்டி.isleap(1999))
அச்சிடு(நாட்காட்டி.isleap(2000))
