#
# வகுப்புகளுடன் பணியாற்றுவதற்கான எடுத்துக்காட்டு கோப்பு
#

class வகுப்பு1():
    def முறை1(self):
        print ("வகுப்பு1 முறை 1")

    def முறை2(self,பிற):
        print ("வகுப்பு1 முறை 2: "+பிற)

class வகுப்பு2():
    def முறை1(self):
        வகுப்பு1.முறை1(self)
        print ("வகுப்பு2 முறை 1")
        
    def முறை2(self):
        print ("வகுப்பு2 முறை 2: ")

def முதன்மை():
    வ=வகுப்பு1()
    வ.முறை1()
    வ.முறை2("இது ஒரு சரம்")
    வ2=வகுப்பு2()
    வ2.முறை1()
    வ2.முறை2()

if __name__ == "__main__":
    முதன்மை()
