#
# யாதும் ஊரே எடுத்துக்காட்டு கோப்பு 
#

# உள்ளீடு, அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ

def முதன்மை():
    அச்சிடு("வணக்கம் வருக ")
    பெயர் = உள்ளீடு ("தங்கள் பெயர் என்ன?")
    அச்சிடு(பெயர், "தங்களை சந்தித்ததில் மகிழ்ச்சி")

if __name__ == "__main__":
    முதன்மை ()
