#
# சுழல்களுடன் வேலை செய்வதற்கான எடுத்துக்காட்டு கோப்பு
#

def main():
  அ = 0

  # while (தவறில்லாதபோது()) சுழற்சியை வரையறுக்கவும் 
  while (அ<5):
    print (அ)
    அ=அ+1
    
  # for (பட்டியல்(+இல்))சுழற்சியை வரையறுக்கவும் 
  for அ in range (5,10):
    print (அ)

  # சேகரிப்பில் for சுழற்சியைப் பயன்படுத்தவும்
  நாட்கள்= ["ஞாயிறு","திங்கள்","செவ்வாய்","புதன்","வியாழன்","வெள்ளி","காரி"]
  for நாள் in நாட்கள்:
    print(நாள்)
  
  # break(முறிவு) மற்றும் continue(தொடர்) அறிக்கைகளைப் பயன்படுத்தவும்
  for அ in range(5,50):
    if (அ==35): break
    if (அ%2==0): continue
    print (அ)

  #குறியீட்டைப் பெற enumerate(கணக்கீடு()) செயல்பாட்டைப் பயன்படுத்துதல்
  நாட்கள்= ["ஞாயிறு","திங்கள்","செவ்வாய்","புதன்","வியாழன்","வெள்ளி","காரி"]
  for ஐ,நாள் in enumerate(நாட்கள்):
    print (ஐ,நாள்)
    
if __name__ == "__main__":
  main()
