#!/usr/bin/env python3

# எண்கள்
# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்):
    print(*வாதங்கள்)

#முழு எண்கள்
அ = 7
ஆ =0o12
இ=0x9A
ஈ =0b1110
அச்சிடு('அ வின் மதிப்பு {}'.format(அ))
அச்சிடு(type(அ))
அச்சிடு(ஆ)
அச்சிடு(இ)
அச்சிடு(ஈ)
அச்சிடு(oct(அ))
அச்சிடு(hex(ஈ))
அச்சிடு(bin(ஆ))

#மிதக்கும் புள்ளி எண்
அ = 7*3.14159
அச்சிடு('அ வின் மதிப்பு {}'.format(அ))
அச்சிடு(type(அ))

ஆ = 0.1+0.1+0.1-0.3
அச்சிடு (ஆ)
# மதிப்பு 0 அல்ல. 0க்கு அருகில்.

#complex numbers
அ= 4+2j
ஆ =5+3j
இ = அ+ஆ
அச்சிடு (இ)

#to change datatype
ஈ =float(44)
உ= int(13.24)
ஊ = complex(10)

அச்சிடு (ஈ,உ,ஊ)

#special class 
from decimal import  *

அ = Decimal('.10')
ஆ = Decimal ('.30')

இ = அ+அ+அ - ஆ

அச்சிடு (இ)
அச்சிடு(type(இ))

ஐ = 7>5
அச்சிடு (ஐ)
அச்சிடு(type(ஐ))
