# 
# மாறிகளுக்கான எடுத்துக்காட்டு கோப்பு
#

# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்):
    print(*வாதங்கள்)

# ஒரு மாறி அறிவித்து அதை துவக்க
அ=0
அச்சிடு (அ)

# மாறியை மறுவடிவமைத்தல்  வேலை செய்கிறது 
அ="அகர முதல "
அச்சிடு(அ)

# பிழை: வெவ்வேறு வகைகளின் மாறிகள் ஒன்றிணைக்க முடியாது
#அச்சிடு(அ+"எழுத்தெல்லம் ஆதி பகவன் முதற்றே உலகு"+1)
அச்சிடு(அ+"எழுத்தெல்லம் ஆதி பகவன் முதற்றே உலகு "+str(1))

#செயல்பாடுகளில் உலகளாவிய எதிராக உள்ளூர் மாறிகள்
def செயல்பாடு():
    #global அ
    அ= "தலை"
    அச்சிடு (அ)

செயல்பாடு()
அச்சிடு (அ)

#del அ
#அச்சிடு(அ)

