#
# உள்ளமைக்கப்பட்ட பைதான் கோப்பு முறைகளைப் பயன்படுத்தி கோப்புகளைப் படித்து எழுதவும்
#

def முதன்மை():
  # எழுதுவதற்கு ஒரு கோப்பைத் திறந்து அது இல்லாவிட்டால் அதை உருவாக்கவும்
  #கோப்பு = open ("உரைகோப்பு.உரை","w+")

  # உரையை இறுதியில் சேர்க்க கோப்பைத் திறக்கவும்
  கோப்பு = open ("உரைகோப்பு.உரை","a+")

  # கோப்பில் சில தரவுகளை எழுதுங்கள்
  for ஐ in range(10):
    கோப்பு.write('இது வரி எண் '+str(ஐ)+'\r\n' )
  
  # முடிந்ததும் கோப்பை மூடு
  கோப்பு.close()

  
  கோப்பு = open ("உரைகோப்பு.உரை","r")
  # கோப்பை மீண்டும் திறந்து உள்ளடக்கங்களைப் படிக்கவும்
  if கோப்பு.mode == "r":
    #உரை=கோப்பு.read()
    #print(உரை)
    வரி = கோப்பு.readlines()
    for அ in வரி:
      print (அ)
  
  கோப்பு.close()

    
if __name__ == "__main__":
  முதன்மை()
