#
# கோப்பு முறைமை மேலோடு முறைகளுடன் பணிபுரியும் எடுத்துக்காட்டு கோப்பு
#
import os
from os import path
import shutil
from shutil import make_archive
from zipfile import ZipFile

def முதன்மை():
  # ஏற்கனவே இருக்கும் கோப்பின் நகலை உருவாக்கவும்
  if path.exists("உரைகோப்பு.உரை"):
    # தற்போதைய கோப்பகத்தில் கோப்பிற்கான பாதையைப் பெறுங்கள்
    மூலம் = path.realpath("உரைகோப்பு.உரை");
        
    # பெயருக்கு "காப்பு" சேர்ப்பதன் மூலம் காப்பு நகலை உருவாக்குவோம்
    இலக்கு = மூலம் + ".காப்பு"
    # இப்போது கோப்பின் நகலை உருவாக்க மேலோடு பயன்படுத்தவும்
    shutil.copy(மூலம்,இலக்கு)
    
    # அனுமதிகள், மாற்றியமைக்கும் நேரங்கள் மற்றும் பிற தகவல்களை நகலெடுக்கவும்
    shutil.copystat(மூலம், இலக்கு)
    
    # அசல் கோப்பினை மறுபெயரிடுக
    #os.rename("உரைகோப்பு.உரை", "புதியகோப்பு.உரை")
    
    # இப்போது கோப்புகளை ஒரு "இறுக்கு" காப்பகத்தில் வைக்கவும் 
    root_dir,tail = path.split(மூலம்)
    shutil.make_archive("காப்பகம்", "zip", root_dir)

    # இறுக்கு கோப்புகளின் மீது இன்னும் கூடுதலான கட்டுப்பாடு
    with ZipFile("சோதனை.இறுக்கு","w") as newzip:
      newzip.write("புதியகோப்பு.உரை")
      newzip.write("உரைகோப்பு.உரை.காப்பு")
            
if __name__ == "__main__":
  முதன்மை()
