#
# கணிதத்துடன் பணிபுரியும் அம்சங்களைக் கொண்ட கணித தொகுதியை import(இறக்குமதி ()) செய்க
#

# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்):
    print(*வாதங்கள்)


import math as கணிதம்

# கணித தொகுதி முன்பே கட்டப்பட்ட செயல்பாடுகளை கொண்டுள்ளது
அச்சிடு ("16 இன் சதுர வேர் ",கணிதம்.sqrt(16))

# செயல்பாடுகளுக்கு கூடுதலாக, சில தொகுதிகள் பயனுள்ள மாறிலிகளைக் கொண்டுள்ளன
அச்சிடு("பை இன் மதிப்பு ",கணிதம்.pi)

# உங்களுக்காக சில கணித செயல்பாடுகளை இங்கே முயற்சிக்கவும்:
அச்சிடு(கணிதம்.cos(45))


