#
#உயர்உரை குறியீட்டு மொழி ->உஉகுமொ
# உஉகுமொவை பாகுபடுத்தி செயலாக்குவதற்கான எடுத்துக்காட்டு கோப்பு
#

#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ

# HTMLParser தொகுதியை இறக்குமதி செய்க
# பைதான் 3 இல் நீங்கள் html.parser இலிருந்து இறக்குமதி செய்ய வேண்டும்
from html.parser import HTMLParser as உஉகுமொபாகுபடுத்தி

மெட்டாஎண்ணிக்கை  = 0

# உஉகுமொபாகுபடுத்தியின் துணைப்பிரிவை உருவாக்கி, கையாளுதல் முறைகளை மேலெழுதும்
class என்உஉகுமொபாகுபடுத்தி(உஉகுமொபாகுபடுத்தி):
  # ஆவணத்தில் தொடக்க குறிச்சொல்லைக் கையாள செயல்பாடு
  # குறிச்சொல்லின் நிறைவு ">" அடையும் போது இது அழைக்கப்படும்
  def handle_starttag(சுயம், குறிச்சொல், பண்புக்கூறுகள்):
    global மெட்டாஎண்ணிக்கை
    if குறிச்சொல் == "meta":
      மெட்டாஎண்ணிக்கை += 1
      

    அச்சிடு ("தொடக்க குறிச்சொல்லை எதிர்கொண்டது:", குறிச்சொல்)
    இடம் = சுயம்.getpos() # ஒரு டியுப்பல் குறிப்புக் கோட்டையும் எழுத்தையும் தருகிறது
    அச்சிடு ("\tவரிசை: ", இடம்[0], " இடம் ", இடம்[1])

    if பண்புக்கூறுகள்.__len__() > 0:
      அச்சிடு ("\tAttributes:")
      for பண்பு in பண்புக்கூறுகள்:
        அச்சிடு ("\t", பண்பு[0],"=",பண்பு[1])
      
  # முடிவு குறிச்சொல்லைக் கையாளும் செயல்பாடு
  def handle_endtag(சுயம், குறிச்சொல்):
    அச்சிடு ("ஒரு இறுதி குறிச்சொல்லை எதிர்கொண்டது:", குறிச்சொல்)
    இடம் = சுயம்.getpos()
    அச்சிடு ("\tவரிசை: ", இடம்[0], " இடம் ", இடம்[1])
    
  # எழுத்து மற்றும் உரை தரவைக் (குறிச்சொல் உள்ளடக்கங்கள்) கையாளும் செயல்பாடு  
  def handle_data(சுயம், தரவு):
    if (தரவு.isspace()):
      return
    அச்சிடு ("சில உரைத் தரவை எதிர்கொண்டது:", தரவு)
    இடம் = சுயம்.getpos()
    அச்சிடு ("\tவரிசை: ", இடம்[0], " இடம் ", இடம்[1])
  
  # உஉகுமொ கருத்துகளின் செயலாக்கத்தைக் கையாள செயல்பாடு 
  def handle_comment(சுயம், தரவு):
    அச்சிடு ("சந்தித்த கருத்து:", தரவு)
    இடம் = சுயம்.getpos()
    அச்சிடு ("\tவரிசை: ", இடம்[0], " இடம் ", இடம்[1])

def முதன்மை():
  # பாகுபடுத்தியை உடனடியாக நிறுவி சில உஉகுமொவை உணவளிக்கவும்
  பாகுபடுத்தி = என்உஉகுமொபாகுபடுத்தி()
    
  # மாதிரி உஉகுமொ கோப்பைத் திறந்து அதைப் படியுங்கள்
  கோப்பு = open("மாதிரி-உஉகுமொ.html")
  if கோப்பு.mode == "r":
    உள்ளடக்கங்கள் = கோப்பு.read() # முழு கோப்பையும் படியுங்கள்
    பாகுபடுத்தி.feed(உள்ளடக்கங்கள்)
  கோப்பு.close()
  அச்சிடு ("%d மெட்டா குறிச்சொற்கள் எதிர்கொண்டன" % மெட்டாஎண்ணிக்கை)

if __name__ == "__main__":
  முதன்மை();
  
