#
# தேதி தகவலுடன் பணியாற்றுவதற்கான எடுத்துக்காட்டு கோப்பு
#

#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ

from datetime import date
from datetime import time
from datetime import datetime as நாள்நேரம்


def  முதன்மை ():
  ## தேதி பொருட்கள்
  # தேதி வகுப்பிலிருந்து எளிய இன்றைய () முறையிலிருந்து இன்றைய தேதியைப் பெறுங்கள்
  இன்று=date.today()
  அச்சிடு("இன்றைய தேதி : ", இன்று)

  # தேதியின் தனிப்பட்ட கூறுகளை அச்சிடுக
  அச்சிடு("தேதி கூறுகள்: ", இன்று.year, இன்று.month, இன்று.day)  

  
  # இன்றைய வாரநாளை மீட்டெடுக்கவும் (0 = திங்கள், 6 = ஞாயிறு)
  அச்சிடு ("இன்றைய வார நாள் எண்: ", இன்று.weekday())
  நாட்கள்= ["திங்கள்","செவ்வாய்","புதன்","வியாழன்","வெள்ளி","காரி","ஞாயிறு"]
  அச்சிடு ("இது ஒரு " + நாட்கள்[இன்று.weekday()]+" கிழமை")
    
  ## தேதிநேர பொருட்கள்
  # இன்றைய தேதியை தேதிநேர வகுப்பிலிருந்து பெறுங்கள்
  இன்று=நாள்நேரம்.now()
  அச்சிடு  ("தற்போதைய தேதி மற்றும் நேரம் ", இன்று)
  
  # தற்போதைய நேரத்தைப் பெறுங்கள்
  நேரம்=நாள்நேரம்.time(நாள்நேரம்.now())
  அச்சிடு ("தற்போதைய நேரம் ", நேரம்)
  இப்போது = நாள்நேரம்.now()

  அச்சிடு(இப்போது.date())
  அச்சிடு(இப்போது.year)
  அச்சிடு(இப்போது.month)
  அச்சிடு(இப்போது.hour)
  அச்சிடு(இப்போது.minute)
  அச்சிடு(இப்போது.second)
  அச்சிடு(இப்போது.time())



  
if __name__ == "__main__":
     முதன்மை();


  



  
