#
# நேரம் மற்றும் தேதி வெளியீட்டை வடிவமைப்பதற்கான எடுத்துக்காட்டு கோப்பு.
#

#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ

from datetime import datetime
import argparse as வாதபிரிப்பான்

def முதன்மை(வா1=0, வா2=0 ):
  # நேரங்கள் மற்றும் தேதிகளை முன் வரையறுக்கப்பட்ட சரத்தின் தொகுப்பைப் பயன்படுத்தி வடிவமைக்க முடியும்
  # கட்டுப்பாட்டு குறியீடுகள்
  இப்போது = datetime.now () # தற்போதைய தேதி மற்றும் நேரத்தைப் பெறுங்கள்
  
  #### தேதி வடிவமைத்தல் ####
  
   #%y /%Y - ஆண்டு, %a/%A - வார நாள், %b/%B - மாதம், %d - மாத நாள்
  அச்சிடு (இப்போது.strftime ("நடப்பு ஆண்டு: %Y")) # நூற்றாண்டுடன் முழு ஆண்டு
  அச்சிடு (இப்போது.strftime ("%y-%b-%d-%a")) # சுருக்கமான ஆண்டு, சுருக்கமான மாதம்,  நாள் எண்,  சுருக்கமான நாள்
  அச்சிடு (இப்போது.strftime ("%Y-%B-%d-%A")) # முழு ஆண்டு, முழு மாதம்,  நாள் எண்,  முழு நாள்
  அச்சிடு (இப்போது.strftime ("%y-%m-%d-%a")) # சுருக்கமான ஆண்டு, மாதம் எண்,  நாள் எண்,  சுருக்கமான நாள்
  
   #%c - மொழியின் தேதி மற்றும் நேரம்,%x - மொழியின் தேதி,%X - மொழியின் நேரம்
  அச்சிடு (இப்போது.strftime ("மொழி தேதி மற்றும் நேரம்: %c"))
  அச்சிடு (இப்போது.strftime ("மொழி தேதி : %x"))
  அச்சிடு (இப்போது.strftime ("மொழி நேரம்: %X"))

   #### நேர வடிவமைப்பு ####
  
   #%I /%H - 12/24 மணி, %M - நிமிடம்,%S - வினாடி, % p - மொழியின் AM / PM 
  அச்சிடு (இப்போது.strftime ("தற்போதைய நேரம்: %I:%M:%S %p")) # 12-மணி:நிமிடம்:வினாடி:காலை
  அச்சிடு (இப்போது.strftime ("24-மணிநேர நேரம் : %H:%M")) # 24-மணி:நிமிடம்

         
if __name__ == "__main__":
	பிரிப்பான் = வாதபிரிப்பான்.ArgumentParser()
	பிரிப்பான்.add_argument( "-உ1", "--உள்ளீடு1", help = "முதல் வாதம்")
	பிரிப்பான்.add_argument( "-உ2", "--உள்ளீடு2", help = "இரண்டாம் வாதம்")
	வாதங்கள் = பிரிப்பான்.parse_args()
	எண்1 = வாதங்கள்.உள்ளீடு1
	எண்2 =  வாதங்கள்.உள்ளீடு2
	முதன்மை(வா1=எண்1, வா2=எண்2 );
