#
#விரிவாக்க குறியீட்டு மொழி ->விகுமொ
#குறைந்த ஆவண பொருள் மாதிரி -> குஆபொமா
# விகுமொ பாகுபடுத்தி செயலாக்குவதற்கான எடுத்துக்காட்டு கோப்பு 
#

#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ

import xml.dom.minidom as விகுமொகுஆபொமா

def முதன்மை():
  # ஒரு விகுமொ கோப்பை ஏற்ற மற்றும் பாகுபடுத்த parse() செயல்பாட்டைப் பயன்படுத்தவும் 
  ஆவணம் = விகுமொகுஆபொமா.parse("மாதிரி-விகுமொ.xml")
  
  # ஆவண முனை மற்றும் முதல் குழந்தை குறிச்சொல்லின் பெயரை அச்சிடுக
  அச்சிடு (ஆவணம்.nodeName)
  அச்சிடு (ஆவணம்.firstChild.tagName)
  
  # ஆவணத்திலிருந்து விகுமொ குறிச்சொற்களின் பட்டியலைப் பெற்று ஒவ்வொன்றையும் அச்சிடுங்கள்
  திறமைகள் = ஆவணம்.getElementsByTagName("skill")
  அச்சிடு ("%d திறமைகள்:" % திறமைகள்.length)
  for திறமை in திறமைகள்:
    அச்சிடு (திறமை.getAttribute("name"))
    
  # ஒரு புதிய விகுமொ குறிச்சொல்லை உருவாக்கி அதை ஆவணத்தில் சேர்க்கவும்
  புதியதிறமை = ஆவணம்.createElement("skill")
  புதியதிறமை.setAttribute("name", "மொழியாக்கம்")
  ஆவணம்.firstChild.appendChild(புதியதிறமை)

  திறமைகள் = ஆவணம்.getElementsByTagName("skill")
  அச்சிடு ("%d திறமைகள்:" % திறமைகள்.length)
  for திறமை in திறமைகள்:
    அச்சிடு (திறமை.getAttribute("name"))

  
if __name__ == "__main__":
  முதன்மை();

