#
# வகுப்புகளுடன் பணியாற்றுவதற்கான எடுத்துக்காட்டு கோப்பு
#

# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)


class பறவை():
    வண்ணம் = 'வெள்ளை'
    def பற(சுயம்):
        அச்சிடு ("பறவை பறக்கும் முறை")

    def நட(சுயம்,பிற):
        அச்சிடு ("பறவை நடக்கும் முறை: "+பிற)

class வாத்து():
    def பற(சுயம்):
        பறவை.பற(சுயம்)
        அச்சிடு ("வாத்து பறக்காது")
        
    def நட(சுயம்):
        அச்சிடு ("வாத்து நடக்கும்: ")

def முதன்மை():
    ப=பறவை()
    ப.பற()
    ப.நட("தை தை")
    வ=வாத்து()
    வ.பற()
    வ.நட()

if __name__ == "__main__":
    முதன்மை()
