#!/usr/bin/env python3

#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ

class  விலங்கு:
    def __init__(சுயம், **சொல்வாதங்கள்):
        சுயம்._வகை = சொல்வாதங்கள்['வகை'] if 'வகை' in சொல்வாதங்கள் else 'பூனைக்குட்டி'
        சுயம்._பெயர்  = சொல்வாதங்கள்['பெயர்'] if 'பெயர்' in சொல்வாதங்கள் else 'பஞ்சு'
        சுயம்._ஒலி = சொல்வாதங்கள்['ஒலி'] if 'ஒலி' in சொல்வாதங்கள் else 'மியாவ்'

    def வகை(சுயம், வ = None):
        if வ: சுயம்._வகை = வ
        return சுயம்._வகை

    def பெயர்(சுயம், பெ = None):
        if பெ: சுயம்._பெயர் = பெ
        return சுயம்._பெயர்

    def ஒலி(சுயம், ஒ = None):
        if ஒ: சுயம்._ஒலி = ஒ
        return சுயம்._ஒலி

    def __str__(சுயம்):
        return f'அந்த {சுயம்.வகை()}  பெயர் "{சுயம்.பெயர்()}" மற்றும் "{சுயம்.ஒலி()}"என்று கூறுகிறது .'

def முதன்மை():
    வி = விலங்கு(வகை = 'பூனைக்குட்டி', பெயர் = 'பஞ்சு', ஒலி = 'மியாவ்')
    வில = விலங்கு(வகை = 'வாத்து ', பெயர் = ' டொனால்ட் ', ஒலி = ' குவாக் ')
    அச்சிடு(வி)
    அச்சிடு(வில)

if __name__ == '__main__': முதன்மை()
