#!/usr/bin/env python3

# அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)


class விலங்கு:
    def __init__(சுயம், வகை, பெயர், ஒலி):
        சுயம்._வகை = வகை
        சுயம்._பெயர் = பெயர்
        சுயம்._ஒலி = ஒலி

    def வகை(சுயம்):
        return சுயம்._வகை

    def பெயர்(சுயம்):
        return சுயம்._பெயர்

    def ஒலி(சுயம்):
        return சுயம்._ஒலி

def அச்சிடு_விலங்கு(பொருள்):
    if not isinstance(பொருள், விலங்கு):
        raise TypeError('அச்சிடு_விலங்கு(): தேவை ஒரு விலங்கு')
    அச்சிடு ('{} க்கு "{}" என்று பெயரிடப்பட்டு மற்றும் அது "{}" என்று கூறுகிறது.'.format(பொருள்.வகை(), பொருள்.பெயர்(), பொருள்.ஒலி()))


def முதன்மை():
    வி = விலங்கு('பூனைக்குட்டி', 'பஞ்சு', 'மியாவ்')
    வில = விலங்கு('வாத்து ',' டொனால்ட் ',' குவாக் ')
    அச்சிடு_விலங்கு(வி)
    அச்சிடு_விலங்கு(வில)
    அச்சிடு_விலங்கு(விலங்கு('வேலோசிராப்டர்', 'வெரோனிகா', 'அலோ' ))

if __name__ == '__main__': முதன்மை()
