#!/usr/bin/env python3

#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ

class  விலங்கு:
    def __init__(சுயம், **சொல்வாதங்கள்):
        சுயம்._வகை = சொல்வாதங்கள்['வகை'] if 'வகை' in சொல்வாதங்கள் else 'பூனைக்குட்டி'
        சுயம்._பெயர்  = சொல்வாதங்கள்['பெயர்'] if 'பெயர்' in சொல்வாதங்கள் else 'பஞ்சு'
        சுயம்._ஒலி = சொல்வாதங்கள்['ஒலி'] if 'ஒலி' in சொல்வாதங்கள் else 'மியாவ்'

    def வகை(சுயம், வ = None):
        if வ: சுயம்._வகை = வ
        try: return சுயம்._வகை
        except AttributeError: return None

    def பெயர்(சுயம், பெ = None):
        if பெ: சுயம்._பெயர் = பெ
        try: return சுயம்._பெயர்
        except AttributeError: return None

    def ஒலி(சுயம், ஒ = None):
        if ஒ: சுயம்._ஒலி = ஒ
        try: return சுயம்._ஒலி
        except AttributeError: return None

class வாத்து(விலங்கு):
    def __init__(சுயம், **சொல்வாதங்கள்):
        சுயம்._வகை = 'வாத்து'
        if 'வகை' in சொல்வாதங்கள்: del சொல்வாதங்கள்['வகை']
        super().__init__(**சொல்வாதங்கள்)

class பூனைக்குட்டி(விலங்கு):
    def __init__(சுயம், **சொல்வாதங்கள்):
        சுயம்._வகை = 'பூனைக்குட்டி'
        if 'வகை' in சொல்வாதங்கள்: del சொல்வாதங்கள்['வகை']
        super().__init__(**சொல்வாதங்கள்)

def அச்சிடு_விலங்கு(வி):
    if not isinstance(வி, விலங்கு):
        raise TypeError('அச்சிடு_விலங்கு(): தேவை ஒரு விலங்கு')
    print(f'அந்த {வி.வகை()} பெயர் "{வி.பெயர்()}" மற்றும் "{வி.ஒலி()}" என்று கூறுகிறது .')

def முதன்மை():
    வி = பூனைக்குட்டி(பெயர் = 'பஞ்சு', ஒலி = 'மியாவ்')
    வில = வாத்து(பெயர் = 'டொனால்ட்', ஒலி = 'குவாக் ')
    அச்சிடு_விலங்கு(வி)
    அச்சிடு_விலங்கு(வில)

if __name__ == '__main__': முதன்மை()
