
#அச்சிடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.
def அச்சிடு(*வாதங்கள்,பிரி=" ",முடி='\n',கோப்பு=None,பறிப்பு=False):
    print(*வாதங்கள், sep=பிரி,end=முடி, file=கோப்பு,flush=பறிப்பு)
    
# உள்ளீடு வரையறு - பின் வரும் நிரல்களில் அச்சிடு பயன்படுத்தலாம்.    
def உள்ளீடு(*வாதங்கள்):
    அ = input (*வாதங்கள்)
    return அ


ர = range(0, 30)
அச்சிடு(type(ர))
அச்சிடு(type(10))
அச்சிடு(type('அ'))
அச்சிடு(type("வணக்கம்"))

class சிற்றுந்து:
    pass

class பாரவண்டி():
    pass

ச = சிற்றுந்து()
மாற்று = சிற்றுந்து()
ப = பாரவண்டி()
அச்சிடு(type(ச))
அச்சிடு(type(ப))
அச்சிடு(type(ச) == type(ப))
அச்சிடு(type(ச) == type(மாற்று))

அச்சிடு(isinstance(ச, சிற்றுந்து))
அச்சிடு(isinstance(ப, சிற்றுந்து))

if isinstance(ர, range):
    அச்சிடு(list(ர))
